import Image from 'next/image'

export default function About() {
    return (
        <main>
            <section className="w-full py-16" style={{ backgroundColor: "var(--primary)" }}>
                <div className="max-w-7xl mx-auto px-[30px] sm:px-6 lg:px-8">
                    <div className='flex justify-center rounded-xl mb-10 overflow-hidden' style={{ backgroundColor: "var(--secondary)" }}>
                        <Image
                            src="/images/about.jpeg"
                            alt="Пані Юля"
                            width={1300}
                            height={1300}
                            className="object-cover"
                            priority
                        />
                    </div>

                    <h1 className="text-3xl font-bold mb-6">Привіт! Я — Юля, і мій шлях до створення дитячого контенту почався з материнства.</h1>

                    <div className="space-y-6 text-lg text-zinc-700 leading-relaxed">
                        <p>
                            До появи сина я була впевнена: жодних екранів до 3-х, а краще до 5-ти років! Але реальність виявилася іншою. Час із дитиною — це щастя, та іноді кожній мамі і кожному татові критично потрібні ці «магічні 20 хвилин» у надійних руках, щоб просто випити теплої кави та поповнити ресурс.
                        </p>
                        <p>
                            Звичайні мультики мене лякали: син завмирав, втупившись в екран, і це було схоже на транс. Я почала шукати альтернативу і знайшла її в англомовному YouTube — відео з реальними ведучими, де дитина не просто дивиться, а комунікує, рухається та співає.
                        </p>
                        <p>
                            Я була вражена результатом, але розчарована тим, що не знайшла нічого подібного рідною мовою.
                            <br />
                            Пів року я вагалася, а потім зрозуміла: якщо цього контенту немає — я маю створити його сама.
                        </p>

                        <h2 className="text-2xl font-bold text-zinc-900 pt-4">Хто я поза екраном?</h2>
                        <p>
                            Моє життя — це поєднання руху, дисципліни та творчості.
                        </p>
                        <ul className="list-disc pl-6 space-y-2">
                            <li>
                                <strong>Спорт та драйв:</strong> Я професійна танцівниця та випускниця Академії фізичної культури. 7 років я будувала кар&apos;єру у фітнес-індустрії: від інструкторки групових програм та тренажерної зали до керівниці команд та викладачки для майбутніх інструкторів.
                            </li>
                            <li>
                                <strong>Технології та монтаж:</strong> Бажання подорожувати привело мене у світ відеомонтажу. Сьогодні я професійна монтажерка, і саме ці навички дозволяють мені створювати якісну картинку для ваших малят.
                            </li>
                        </ul>

                        <h2 className="text-2xl font-bold text-zinc-900 pt-4">Чому проєкт «Пані Юля» — це не просто відео?</h2>
                        <p>
                            Я — «людина-оркестр». Весь свій досвід — від знання фізіології руху до магії відеосклейки — я вкладаю у кожен ролик. Я сама пишу сценарії, створюю пісні та продумую ігри.
                        </p>

                        <h2 className="text-2xl font-bold text-zinc-900 pt-4">Моя головна місія — відео, що активізують, а не «зомбують».</h2>
                        <p>
                            Для мене немає більшого щастя, ніж бачити ваші відгуки: як дітки повторюють мої рухи, вивчають перші слова чи співають пісні. У ці моменти я розумію, що моя справа важлива!
                        </p>

                        <p className="font-semibold pt-4">
                            Дякую кожним мамі й тату, що обираєте мій канал.
                        </p>
                    </div>
                </div>
            </section>
        </main>
    )
}
